.: AJPFuzzer v0.7 - Doyensec.com :.
-----------------------------------

AJPFuzzer> connect 192.168.56.101:8009
asg.cliche.CLIException: There's no command "connect" taking 1 arguments
AJPFuzzer> 192.168.56.101:8009
asg.cliche.CLIException: Unknown command: "192.168.56.101:8009"
AJPFuzzer> connect 192.168.56.101 8009
[*] Connecting to 192.168.56.101:8009
Connected to the remote AJP13 service
AJPFuzzer/192.168.56.101:8009> ?list
abbrev	name	params
sta	status	()
quit	quit	()
rc	reconnect	()
1	body	(data)
2	forwardrequest	(method, protocol, requestUri, remoteAddr, remoteHost, serverName, serverPort, isSsl, headers, attributes)
3	sendbodychunk	(data)
4	sendheaders	(statuscode, statusmessage, headers)
5	endresponse	(reuse)
6	getbodychunk	(length)
7	shutdown	()
8	ping	()
9	cpong	()
10	cping	()
11	forwardreqalltypes	(url)
12	verbtampering	(url)
13	jettyleak	(url)
14	hugelengthsmallbody	(url)
15	hugeheader	(url)
16	fuzzbit	(url)
17	fuzzslice	(url)
18	servletpath	(url, servletpath)
19	bypassauthnull	(url)
20	envars	(url, enname, envalue)
21	hugepacketsize	()
22	genericfuzz	(method, protocol, requestUri, remoteAddr, remoteHost, serverName, serverPort, isSsl, headers, attributes, path)
AJPFuzzer/192.168.56.101:8009> sta
[*] Connected

AJPFuzzer/192.168.56.101:8009> 1
asg.cliche.CLIException: There's no command "1" taking 0 arguments
AJPFuzzer/192.168.56.101:8009> body
asg.cliche.CLIException: There's no command "body" taking 0 arguments
AJPFuzzer/192.168.56.101:8009> generocfuzz remoteHost
asg.cliche.CLIException: Unknown command: "generocfuzz"
AJPFuzzer/192.168.56.101:8009> genericfuzz remoteHost
asg.cliche.CLIException: There's no command "genericfuzz" taking 1 arguments
AJPFuzzer/192.168.56.101:8009> clear
asg.cliche.CLIException: Unknown command: "clear"
AJPFuzzer/192.168.56.101:8009> ls
asg.cliche.CLIException: Unknown command: "ls"
AJPFuzzer/192.168.56.101:8009> ?
This is Connected to the remote AJP13 service, running on Cliche Shell
For more information on the Shell, enter ?help
AJPFuzzer/192.168.56.101:8009> ?help
This is Cliche shell (http://cliche.sourceforge.net).
To list all available commands enter ?list or ?list-all, the latter will also show you system commands. To get detailed info on a command enter ?help command-name
AJPFuzzer/192.168.56.101:8009> ?list-all
abbrev	name	params
!rs	!run-script	(filename)
!el	!enable-logging	(fileName)
!dl	!disable-logging	()
!sdt	!set-display-time	(do-display-time)
!gle	!get-last-exception	()
?l	?list	(startsWith)
?l	?list	()
?h	?help	()
?h	?help	(command-name)
?ghh	?generate-HTML-help	(file-name, include-prefixed)
?la	?list-all	()
sta	status	()
quit	quit	()
rc	reconnect	()
1	body	(data)
2	forwardrequest	(method, protocol, requestUri, remoteAddr, remoteHost, serverName, serverPort, isSsl, headers, attributes)
3	sendbodychunk	(data)
4	sendheaders	(statuscode, statusmessage, headers)
5	endresponse	(reuse)
6	getbodychunk	(length)
7	shutdown	()
8	ping	()
9	cpong	()
10	cping	()
11	forwardreqalltypes	(url)
12	verbtampering	(url)
13	jettyleak	(url)
14	hugelengthsmallbody	(url)
15	hugeheader	(url)
16	fuzzbit	(url)
17	fuzzslice	(url)
18	servletpath	(url, servletpath)
19	bypassauthnull	(url)
20	envars	(url, enname, envalue)
21	hugepacketsize	()
22	genericfuzz	(method, protocol, requestUri, remoteAddr, remoteHost, serverName, serverPort, isSsl, headers, attributes, path)
AJPFuzzer/192.168.56.101:8009> ?help genericfuzz
Command: genericfuzz
Abbrev:  22
Params:  (method, protocol, requestUri, remoteAddr, remoteHost, serverName, serverPort, isSsl, headers, attributes, path)
Description: Create an AJP13 ForwardRequest (GET) that allows fuzzing arbitrary message elements - the fuzzing list should be passed as the last argument
Number of parameters: 11
method	int	HTTP verb (e.g. GET=2)
protocol	String	HTTP protocol (e.g. HTTP/1.1)
requestUri	String	Request URI (e.g. /api/)
remoteAddr	String	Client IP address
remoteHost	String	Client FQDN
serverName	String	Server FQDN
serverPort	int	Server TCP port
isSsl	boolean	Is SSL? Boolean
headers	String	HTTP headers as <name>:<value>,<name>:<value>,...
attributes	String	HTTP attributes as <name>:<value>,<name>:<value>,...
path	String	Fuzzing file


AJPFuzzer/192.168.56.101:8009> ?list-all
abbrev	name	params
!rs	!run-script	(filename)
!el	!enable-logging	(fileName)
!dl	!disable-logging	()
!sdt	!set-display-time	(do-display-time)
!gle	!get-last-exception	()
?l	?list	(startsWith)
?l	?list	()
?h	?help	()
?h	?help	(command-name)
?ghh	?generate-HTML-help	(file-name, include-prefixed)
?la	?list-all	()
sta	status	()
quit	quit	()
rc	reconnect	()
1	body	(data)
2	forwardrequest	(method, protocol, requestUri, remoteAddr, remoteHost, serverName, serverPort, isSsl, headers, attributes)
3	sendbodychunk	(data)
4	sendheaders	(statuscode, statusmessage, headers)
5	endresponse	(reuse)
6	getbodychunk	(length)
7	shutdown	()
8	ping	()
9	cpong	()
10	cping	()
11	forwardreqalltypes	(url)
12	verbtampering	(url)
13	jettyleak	(url)
14	hugelengthsmallbody	(url)
15	hugeheader	(url)
16	fuzzbit	(url)
17	fuzzslice	(url)
18	servletpath	(url, servletpath)
19	bypassauthnull	(url)
20	envars	(url, enname, envalue)
21	hugepacketsize	()
22	genericfuzz	(method, protocol, requestUri, remoteAddr, remoteHost, serverName, serverPort, isSsl, headers, attributes, path)
AJPFuzzer/192.168.56.101:8009> genericfuzz 2 "HTTP/1.1" "/test.html" "192.168.56.101" "192.168.56.101" "server.name.test" 8009 false "Cookie:AAAA=BBBB" "secret:FUZZ" /etc/shadow
java.nio.file.AccessDeniedException: /etc/shadow
java.nio.file.AccessDeniedException: /etc/shadow
	at java.base/sun.nio.fs.UnixException.translateToIOException(UnixException.java:90)
	at java.base/sun.nio.fs.UnixException.rethrowAsIOException(UnixException.java:106)
	at java.base/sun.nio.fs.UnixException.rethrowAsIOException(UnixException.java:111)
	at java.base/sun.nio.fs.UnixFileSystemProvider.newByteChannel(UnixFileSystemProvider.java:218)
	at java.base/java.nio.file.Files.newByteChannel(Files.java:380)
	at java.base/java.nio.file.Files.newByteChannel(Files.java:432)
	at java.base/java.nio.file.spi.FileSystemProvider.newInputStream(FileSystemProvider.java:422)
	at java.base/java.nio.file.Files.newInputStream(Files.java:160)
	at java.base/java.nio.file.Files.newBufferedReader(Files.java:2922)
	at java.base/java.nio.file.Files.readAllLines(Files.java:3412)
	at java.base/java.nio.file.Files.readAllLines(Files.java:3453)
	at com.doyensec.ajpfuzzer.AJPTestCases.dirTraversalMessage(AJPTestCases.java:547)
	at java.base/jdk.internal.reflect.NativeMethodAccessorImpl.invoke0(Native Method)
	at java.base/jdk.internal.reflect.NativeMethodAccessorImpl.invoke(NativeMethodAccessorImpl.java:77)
	at java.base/jdk.internal.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:43)
	at java.base/java.lang.reflect.Method.invoke(Method.java:569)
	at asg.cliche.ShellCommand.invoke(ShellCommand.java:69)
	at asg.cliche.Shell.processCommand(Shell.java:294)
	at asg.cliche.Shell.processLine(Shell.java:276)
	at asg.cliche.Shell.commandLoop(Shell.java:231)
	at com.doyensec.ajpfuzzer.AJPFuzzer.connect(AJPFuzzer.java:89)
	at java.base/jdk.internal.reflect.NativeMethodAccessorImpl.invoke0(Native Method)
	at java.base/jdk.internal.reflect.NativeMethodAccessorImpl.invoke(NativeMethodAccessorImpl.java:77)
	at java.base/jdk.internal.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:43)
	at java.base/java.lang.reflect.Method.invoke(Method.java:569)
	at asg.cliche.ShellCommand.invoke(ShellCommand.java:69)
	at asg.cliche.Shell.processCommand(Shell.java:294)
	at asg.cliche.Shell.processLine(Shell.java:276)
	at asg.cliche.Shell.commandLoop(Shell.java:231)
	at com.doyensec.ajpfuzzer.AJPFuzzer.main(AJPFuzzer.java:168)
AJPFuzzer/192.168.56.101:8009> genericfuzz 2 "HTTP/1.1" "/test.html" "192.168.56.101" "192.168.56.101" "server.name.test" 8009 false "Cookie:AAAA=BBBB" "secret:FUZZ" /home/
java.io.IOException: Is a directory
java.io.IOException: Is a directory
	at java.base/sun.nio.ch.FileDispatcherImpl.read0(Native Method)
	at java.base/sun.nio.ch.FileDispatcherImpl.read(FileDispatcherImpl.java:48)
	at java.base/sun.nio.ch.IOUtil.readIntoNativeBuffer(IOUtil.java:330)
	at java.base/sun.nio.ch.IOUtil.read(IOUtil.java:296)
	at java.base/sun.nio.ch.IOUtil.read(IOUtil.java:273)
	at java.base/sun.nio.ch.FileChannelImpl.read(FileChannelImpl.java:232)
	at java.base/sun.nio.ch.ChannelInputStream.read(ChannelInputStream.java:65)
	at java.base/sun.nio.ch.ChannelInputStream.read(ChannelInputStream.java:107)
	at java.base/sun.nio.ch.ChannelInputStream.read(ChannelInputStream.java:101)
	at java.base/sun.nio.cs.StreamDecoder.readBytes(StreamDecoder.java:287)
	at java.base/sun.nio.cs.StreamDecoder.implRead(StreamDecoder.java:330)
	at java.base/sun.nio.cs.StreamDecoder.read(StreamDecoder.java:190)
	at java.base/java.io.InputStreamReader.read(InputStreamReader.java:177)
	at java.base/java.io.BufferedReader.fill(BufferedReader.java:162)
	at java.base/java.io.BufferedReader.readLine(BufferedReader.java:329)
	at java.base/java.io.BufferedReader.readLine(BufferedReader.java:396)
	at java.base/java.nio.file.Files.readAllLines(Files.java:3415)
	at java.base/java.nio.file.Files.readAllLines(Files.java:3453)
	at com.doyensec.ajpfuzzer.AJPTestCases.dirTraversalMessage(AJPTestCases.java:547)
	at java.base/jdk.internal.reflect.NativeMethodAccessorImpl.invoke0(Native Method)
	at java.base/jdk.internal.reflect.NativeMethodAccessorImpl.invoke(NativeMethodAccessorImpl.java:77)
	at java.base/jdk.internal.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:43)
	at java.base/java.lang.reflect.Method.invoke(Method.java:569)
	at asg.cliche.ShellCommand.invoke(ShellCommand.java:69)
	at asg.cliche.Shell.processCommand(Shell.java:294)
	at asg.cliche.Shell.processLine(Shell.java:276)
	at asg.cliche.Shell.commandLoop(Shell.java:231)
	at com.doyensec.ajpfuzzer.AJPFuzzer.connect(AJPFuzzer.java:89)
	at java.base/jdk.internal.reflect.NativeMethodAccessorImpl.invoke0(Native Method)
	at java.base/jdk.internal.reflect.NativeMethodAccessorImpl.invoke(NativeMethodAccessorImpl.java:77)
	at java.base/jdk.internal.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:43)
	at java.base/java.lang.reflect.Method.invoke(Method.java:569)
	at asg.cliche.ShellCommand.invoke(ShellCommand.java:69)
	at asg.cliche.Shell.processCommand(Shell.java:294)
	at asg.cliche.Shell.processLine(Shell.java:276)
	at asg.cliche.Shell.commandLoop(Shell.java:231)
	at com.doyensec.ajpfuzzer.AJPFuzzer.main(AJPFuzzer.java:168)
AJPFuzzer/192.168.56.101:8009> genericfuzz 2 "HTTP/1.1" "/test.html" "192.168.56.101" "192.168.56.101" "server.name.test" 8009 false "Cookie:AAAA=BBBB" "secret:FUZZ" cd /home/ & ls
asg.cliche.CLIException: There's no command "genericfuzz" taking 14 arguments
AJPFuzzer/192.168.56.101:8009> genericfuzz 2 "HTTP/1.1" "/test.html" "192.168.56.101" "192.168.56.101" "server.name.test" 8009 false "Cookie:AAAA=BBBB" "secret:FUZZ" "cd /home/ & ls"
java.nio.file.NoSuchFileException: cd /home/ & ls
java.nio.file.NoSuchFileException: cd /home/ & ls
	at java.base/sun.nio.fs.UnixException.translateToIOException(UnixException.java:92)
	at java.base/sun.nio.fs.UnixException.rethrowAsIOException(UnixException.java:106)
	at java.base/sun.nio.fs.UnixException.rethrowAsIOException(UnixException.java:111)
	at java.base/sun.nio.fs.UnixFileSystemProvider.newByteChannel(UnixFileSystemProvider.java:218)
	at java.base/java.nio.file.Files.newByteChannel(Files.java:380)
	at java.base/java.nio.file.Files.newByteChannel(Files.java:432)
	at java.base/java.nio.file.spi.FileSystemProvider.newInputStream(FileSystemProvider.java:422)
	at java.base/java.nio.file.Files.newInputStream(Files.java:160)
	at java.base/java.nio.file.Files.newBufferedReader(Files.java:2922)
	at java.base/java.nio.file.Files.readAllLines(Files.java:3412)
	at java.base/java.nio.file.Files.readAllLines(Files.java:3453)
	at com.doyensec.ajpfuzzer.AJPTestCases.dirTraversalMessage(AJPTestCases.java:547)
	at java.base/jdk.internal.reflect.NativeMethodAccessorImpl.invoke0(Native Method)
	at java.base/jdk.internal.reflect.NativeMethodAccessorImpl.invoke(NativeMethodAccessorImpl.java:77)
	at java.base/jdk.internal.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:43)
	at java.base/java.lang.reflect.Method.invoke(Method.java:569)
	at asg.cliche.ShellCommand.invoke(ShellCommand.java:69)
	at asg.cliche.Shell.processCommand(Shell.java:294)
	at asg.cliche.Shell.processLine(Shell.java:276)
	at asg.cliche.Shell.commandLoop(Shell.java:231)
	at com.doyensec.ajpfuzzer.AJPFuzzer.connect(AJPFuzzer.java:89)
	at java.base/jdk.internal.reflect.NativeMethodAccessorImpl.invoke0(Native Method)
	at java.base/jdk.internal.reflect.NativeMethodAccessorImpl.invoke(NativeMethodAccessorImpl.java:77)
	at java.base/jdk.internal.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:43)
	at java.base/java.lang.reflect.Method.invoke(Method.java:569)
	at asg.cliche.ShellCommand.invoke(ShellCommand.java:69)
	at asg.cliche.Shell.processCommand(Shell.java:294)
	at asg.cliche.Shell.processLine(Shell.java:276)
	at asg.cliche.Shell.commandLoop(Shell.java:231)
	at com.doyensec.ajpfuzzer.AJPFuzzer.main(AJPFuzzer.java:168)
AJPFuzzer/192.168.56.101:8009> genericfuzz 2 "HTTP/1.1" "/test.html" "192.168.56.101" "192.168.56.101" "server.name.test" 8009 false "Cookie:AAAA=BBBB" "secret:FUZZ" conf/tomcat-users.xml
java.nio.file.NoSuchFileException: conf/tomcat-users.xml
java.nio.file.NoSuchFileException: conf/tomcat-users.xml
	at java.base/sun.nio.fs.UnixException.translateToIOException(UnixException.java:92)
	at java.base/sun.nio.fs.UnixException.rethrowAsIOException(UnixException.java:106)
	at java.base/sun.nio.fs.UnixException.rethrowAsIOException(UnixException.java:111)
	at java.base/sun.nio.fs.UnixFileSystemProvider.newByteChannel(UnixFileSystemProvider.java:218)
	at java.base/java.nio.file.Files.newByteChannel(Files.java:380)
	at java.base/java.nio.file.Files.newByteChannel(Files.java:432)
	at java.base/java.nio.file.spi.FileSystemProvider.newInputStream(FileSystemProvider.java:422)
	at java.base/java.nio.file.Files.newInputStream(Files.java:160)
	at java.base/java.nio.file.Files.newBufferedReader(Files.java:2922)
	at java.base/java.nio.file.Files.readAllLines(Files.java:3412)
	at java.base/java.nio.file.Files.readAllLines(Files.java:3453)
	at com.doyensec.ajpfuzzer.AJPTestCases.dirTraversalMessage(AJPTestCases.java:547)
	at java.base/jdk.internal.reflect.NativeMethodAccessorImpl.invoke0(Native Method)
	at java.base/jdk.internal.reflect.NativeMethodAccessorImpl.invoke(NativeMethodAccessorImpl.java:77)
	at java.base/jdk.internal.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:43)
	at java.base/java.lang.reflect.Method.invoke(Method.java:569)
	at asg.cliche.ShellCommand.invoke(ShellCommand.java:69)
	at asg.cliche.Shell.processCommand(Shell.java:294)
	at asg.cliche.Shell.processLine(Shell.java:276)
	at asg.cliche.Shell.commandLoop(Shell.java:231)
	at com.doyensec.ajpfuzzer.AJPFuzzer.connect(AJPFuzzer.java:89)
	at java.base/jdk.internal.reflect.NativeMethodAccessorImpl.invoke0(Native Method)
	at java.base/jdk.internal.reflect.NativeMethodAccessorImpl.invoke(NativeMethodAccessorImpl.java:77)
	at java.base/jdk.internal.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:43)
	at java.base/java.lang.reflect.Method.invoke(Method.java:569)
	at asg.cliche.ShellCommand.invoke(ShellCommand.java:69)
	at asg.cliche.Shell.processCommand(Shell.java:294)
	at asg.cliche.Shell.processLine(Shell.java:276)
	at asg.cliche.Shell.commandLoop(Shell.java:231)
	at com.doyensec.ajpfuzzer.AJPFuzzer.main(AJPFuzzer.java:168)
AJPFuzzer/192.168.56.101:8009> ?list
abbrev	name	params
sta	status	()
quit	quit	()
rc	reconnect	()
1	body	(data)
2	forwardrequest	(method, protocol, requestUri, remoteAddr, remoteHost, serverName, serverPort, isSsl, headers, attributes)
3	sendbodychunk	(data)
4	sendheaders	(statuscode, statusmessage, headers)
5	endresponse	(reuse)
6	getbodychunk	(length)
7	shutdown	()
8	ping	()
9	cpong	()
10	cping	()
11	forwardreqalltypes	(url)
12	verbtampering	(url)
13	jettyleak	(url)
14	hugelengthsmallbody	(url)
15	hugeheader	(url)
16	fuzzbit	(url)
17	fuzzslice	(url)
18	servletpath	(url, servletpath)
19	bypassauthnull	(url)
20	envars	(url, enname, envalue)
21	hugepacketsize	()
22	genericfuzz	(method, protocol, requestUri, remoteAddr, remoteHost, serverName, serverPort, isSsl, headers, attributes, path)
AJPFuzzer/192.168.56.101:8009> exit
AJPFuzzer> exit
[*] Disconnecting...
